Autodesk.Revit.VSTA.ApplicationEntryPoint.#ctor(Autodesk.Revit.ApplicationServices.Application)
Use a database level Application to construct a UI-level Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.VSTA.ApplicationEntryPoint.#ctor(Autodesk.Revit.ApplicationServices.ControlledApplication)
Use a database level Application to construct a UI-level Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL